Tekla Open API Reference for Tekla Structures 2025
Events.OnUndoClicked Method
 Called when user clicks undo.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void OnUndoClicked()
Public Sub OnUndoClicked
Implements
IEvents.OnUndoClicked()
See Also
Reference
Events Class
Tekla.Structures.Model Namespace